#Использовать asserts
#Использовать autumn
#Использовать "../src"

Процедура ПередЗапускомТеста() Экспорт
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
КонецПроцедуры

&Тест
Процедура НастройкиИнициализированы() Экспорт

	// Дано
	Поделка = Новый Поделка();
	Поделка.ПросканироватьКаталог(ТекущийКаталог());
	Поделка.ЗапуститьПриложение();
	Настройки = Поделка.НайтиЖелудь("Приложение").Настройки();

	// Когда

	// Тогда
	Ожидаем.Что(Настройки, "Настройки приложения не инициализированы").Не_().Равно(Неопределено);
	
КонецПроцедуры

&Тест
Процедура СуществуетНастройка_КаталогШаблонов() Экспорт
	
	// Дано
	Поделка = Новый Поделка();
	Поделка.ПросканироватьКаталог(ТекущийКаталог());
	Поделка.ЗапуститьПриложение();
	КаталогШаблонов = Поделка.НайтиЖелудь("Приложение").Настройки().КаталогШаблонов();

	// Когда

	// Тогда
	Ожидаем.Что(КаталогШаблонов, "Настройка КаталогШаблонов не существует").Не_().Равно(Неопределено);
	
КонецПроцедуры

&Тест
Процедура СуществуетНастройка_КаталогСохранения() Экспорт
	
	// Дано
	Поделка = Новый Поделка();
	Поделка.ПросканироватьКаталог(ТекущийКаталог());
	Поделка.ЗапуститьПриложение();
	КаталогСохранения = Поделка.НайтиЖелудь("Приложение").Настройки().КаталогСохранения();

	// Когда

	// Тогда
	Ожидаем.Что(КаталогСохранения, "Настройка КаталогШаблонов не существует").Не_().Равно(Неопределено);
	
КонецПроцедуры

&Тест
Процедура СуществуетНастройка_КаталогВременныхФайлов() Экспорт
	
	// Дано
	Поделка = Новый Поделка();
	Поделка.ПросканироватьКаталог(ТекущийКаталог());
	Поделка.ЗапуститьПриложение();
	КаталогВременныхФайлов = Поделка.НайтиЖелудь("Приложение").Настройки().КаталогВременныхФайлов();

	// Когда

	// Тогда
	Ожидаем.Что(КаталогВременныхФайлов, "Настройка КаталогШаблонов не существует").Не_().Равно(Неопределено);
	
КонецПроцедуры
